Autodesk.Revit.UI.IExternalCommand.Execute(Autodesk.Revit.UI.ExternalCommandData,System.String@,Autodesk.Revit.DB.ElementSet)
Overload this method to implement and external command within Revit.
Returns:  The result indicates if the execution fails, succeeds, or was canceled by user. If it does not
succeed, Revit will undo any changes made by the external command.
commandData:  An ExternalCommandData object which contains reference to Application and View
needed by external command.
message:  Error message can be returned by external command. This will be displayed only if the command status
was "Failed".  There is a limit of 1023 characters for this message; strings longer than this will be truncated.
elements:  Element set indicating problem elements to display in the failure dialog.  This will be used
only if the command status was "Failed".

Autodesk.Revit.UI.IExternalCommand
An interface that should be implemented to provide the implementation for a Revit add-in External Command.
Remarks: To add an external command to Autodesk Revit the developer should implement an object
that supports the IExternalCommand interface.